In [54]:
from pandas import DataFrame

In [55]:
data={'name':['Ebin', 'Alex'],
     'age':[25,64],
     'salary' : [25, 10]}

In [56]:
frame=DataFrame(data)
frame

   name  age  salary
0  Ebin   25      25
1  Alex   64      10

In [70]:
newframe=DataFrame(data, columns=['name','salary', 'age'])
newframe

   name  salary  age
0  Ebin      25   25
1  Alex      10   64

In [71]:
newframe.loc[1]

name      Alex
salary      10
age         64
Name: 1, dtype: object

In [80]:
newframe['profile']='IT', 'tailor'
newframe['edu']='BCA', '10'
newframe

   name  salary  age profile  edu (0, 2)
0  Ebin      25   25      IT  BCA    NaN
1  Alex      10   64  tailor   10    NaN

In [92]:
newframe.drop((0,2), axis=1, inplace=True)

In [99]:
newframe.loc[len(newframe)] = ["Stella Alex", 35, 50, 'House Wife', 10]

In [100]:
newframe

          name  salary  age     profile  edu
0         Ebin      25   25          IT  BCA
1         Alex      10   64      tailor   10
2  Stella Alex      35   50  House Wife   10

In [88]:
newframe

   name  salary  age profile  edu (0, 2)
0  Ebin      25   25      IT  BCA    NaN
1  Alex      10   64  tailor   10    NaN

In [110]:
from pandas import Series
obj=Series([1,2,3], index=['a','b','c'])

In [111]:
obj

a    1
b    2
c    3
dtype: int64

In [112]:
obj=obj.reindex(['a','c','b'])

In [113]:
obj

a    1
c    3
b    2
dtype: int64